## Challenge
In this lab, the objective is to identify the customers who were active in both May and June, 
and how did their activity differ between months. To achieve this, follow these steps:

1. Establish a connection between Python and the Sakila database.

2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:
* engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
* month: an integer representing the month for which rental data is to be retrieved.
* year: an integer representing the year for which rental data is to be retrieved.

The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [1]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

### Lab SQL-Python | 1

In [2]:
# 1. Establish a connection between Python and the Sakila database.

In [3]:
password = getpass()

········

In [4]:
# print(password)

In [5]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [6]:
type(engine)

sqlalchemy.engine.base.Engine

### Lab SQL-Python | 2

In [7]:
# 2. Write a Python function called rentals_month that retrieves rental data for a given month 
# and year (passed as parameters) from the Sakila database as a Pandas DataFrame. 
# The function should take in three parameters:
# * engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
# * month: an integer representing the month for which rental data is to be retrieved.
# * year: an integer representing the year for which rental data is to be retrieved.

In [8]:
def rentals_month(engine, month, year):

    # database connection
    connection = engine.connect()

    # SQL query
    query = f"""
    SELECT * 
    FROM sakila.rental 
    WHERE DATE_FORMAT(CONVERT(LEFT(rental_date, 9), DATE), '%%m') = {month} 
    AND DATE_FORMAT(CONVERT(LEFT(rental_date, 9), DATE), '%%y') = {year}
    ORDER BY customer_id ASC
    """

    # Execute the SQL query and fetch the results into a Pandas DataFrame
    rental_data = pd.read_sql(query, connection)

    return rental_data

In [9]:
# 24/05/2005 to 14/02/2006
month1 = '05'
year1 = '05'
rental_data = rentals_month(engine, month1, year1)
rental_data.head(10)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,76,2005-05-25 11:30:37,3021,1,2005-06-03 12:00:37,2,2006-02-15 21:30:53
1,573,2005-05-28 10:35:23,4020,1,2005-06-03 06:32:23,1,2006-02-15 21:30:53
2,320,2005-05-27 00:09:24,1090,2,2005-05-28 04:30:24,2,2006-02-15 21:30:53
3,435,2005-05-27 17:17:09,3328,3,2005-06-02 11:20:09,2,2006-02-15 21:30:53
4,830,2005-05-29 22:43:55,3464,3,2005-06-01 17:43:55,1,2006-02-15 21:30:53
5,731,2005-05-29 07:25:16,4124,5,2005-05-30 05:21:16,1,2006-02-15 21:30:53
6,1085,2005-05-31 11:15:43,301,5,2005-06-07 12:02:43,1,2006-02-15 21:30:53
7,1142,2005-05-31 19:46:38,3998,5,2005-06-05 14:03:38,1,2006-02-15 21:30:53
8,57,2005-05-25 08:43:32,3938,6,2005-05-29 06:42:32,2,2006-02-15 21:30:53
9,577,2005-05-28 11:09:14,375,6,2005-06-01 13:27:14,2,2006-02-15 21:30:53

### Lab SQL-Python | 3

In [10]:
# 3. Develop a Python function called rental_count_month that takes the DataFrame provided by 
# rentals_month as input along with the month and year 
# and returns a new DataFrame containing the number of rentals made by each customer_id 
# during the selected month and year.

In [11]:
def rental_count_month(rentals_month, month, year):
    
    # Filter the DataFrame based on the selected month and year
    filtered_rentals = rentals_month(engine, month, year)
    
    # Group the filtered DataFrame by customer_id and count the number of rentals for each customer
    rentals_count = filtered_rentals.groupby('customer_id')['rental_id'].count().reset_index()
    
    return rentals_count

In [12]:
# 24/05/2005 to 14/02/2006
month2 = '06'
year2 = '05'
df2=rental_count_month(rentals_month, month2, year2)
print(df2.head(10),df2.shape)

   customer_id  rental_id
0            1          7
1            2          1
2            3          4
3            4          6
4            5          5
5            6          4
6            7          5
7            8          3
8            9          2
9           10          5 (590, 2)

### Lab SQL-Python | 4

In [13]:
# 4. Create a Python function called compare_rentals that takes two DataFrames as input containing
# the number of rentals made by each customer in different months and years. 
# The function should return a combined DataFrame with a new 'difference' column, 
# which is the difference between the number of rentals in the two months.

In [14]:
def compare_rentals(df1, df2):
    # Transform df1 to have only the columns that we need
    df1 = rental_data.groupby('customer_id')['rental_id'].count().reset_index()
    
    # add a new column with month/year to df1
    month_year1= f"{month1} {year1}"
    df1['month_year'] = month_year1
    
    # add a new column with month/year to df2
    month_year2=f"{month2} {year2}"
    df2['month_year'] = month_year2
    
    # Merge the two DataFrames on 'customer_id' to combine the rental counts
    combined_df = pd.concat([df1, df2], axis=0)

    # Rename the columns for clarity
    pivoted_df = combined_df.pivot(index='customer_id', columns='month_year', values='rental_id').reset_index()

    # Fill NaN values in 'month_year1' and 'month_year2' with 0
    pivoted_df[month_year1].fillna(0, inplace=True)
    pivoted_df[month_year2].fillna(0, inplace=True)    
    
    # Calculate the difference between the two months
    pivoted_df['Difference'] = pivoted_df[month_year2] - pivoted_df[month_year1]
    
    pivoted_df['Difference'] = pivoted_df['Difference'].astype(int)
    pivoted_df[month_year1] = pivoted_df[month_year1].astype(int)
    pivoted_df[month_year2] = pivoted_df[month_year2].astype(int)
    
    return pivoted_df

### Lab SQL-Python | End

In [15]:
df1=rental_data
df3=compare_rentals(df1, df2)
df3.head()

month_year  customer_id  05 05  06 05  Difference
0                     1      2      7           5
1                     2      1      1           0
2                     3      2      4           2
3                     4      0      6           6
4                     5      3      5           2